sergev/pic32prog/target.c
    /* Get protocol prefix. */
    delimiter = strchr(port_name, ':');
    if (! delimiter) {
        /* Use stk500v2 protocol by default. */
        return serial_tab[0].func(port_name, baud_rate);
    }
    prefix_len = delimiter - port_name;
    prefix = port_name;
    port_name = delimiter + 1;

    /* Find prefix in the protocol table. */
    for (i=0; serial_tab[i].prefix; i++) {
        len = strlen(serial_tab[i].prefix);
        if (prefix_len == len &&
            strncasecmp(prefix, serial_tab[i].prefix, len) == 0) {
            return serial_tab[i].func(port_name, baud_rate);
        }
    }
    return 0;
}

/*
 * Parse the name of the device.
 * Return 1 in case of USB device (0 for serial).
 */
static int is_usb_device(const char *port_name)
{
    const char *delimiter;

    /* No device name specified - search for a known USB device. */
    if (!port_name)
        return 1;

    /* Get protocol prefix. */
    delimiter = strchr(port_name, ':');
    if (!delimiter) {
        /* No protocol prefix - use serial protocol. */
        return 0;
    }

    /* Get VID. */
    delimiter = strchr(delimiter + 1, ':');
    if (!delimiter) {
        /* No VID - assume serial protocol. */
        return 0;
    }

    /* Protocol prefix, VID and PID are present - use USB protocol. */
    return 1;
}

/*
 * Connect to JTAG adapter.
 */
target_t *target_open(const char *port_name, int baud_rate, int interface, int speed)
{
    target_t *t;

    t = calloc(1, sizeof(target_t));
    if (! t) {
        fprintf(stderr, _("Out of memory\n"));
        exit(-1);
    }
    t->cpu_name = "Unknown";

    /* Update pic2_tab[] array from the pic32prog.conf file. */
    target_configure();

    /* Find adapter. */
    if (is_usb_device(port_name)) {
        t->adapter = open_usb_adapter(port_name, interface, speed);
    } else {
        t->adapter = open_serial_adapter(port_name, baud_rate, interface, speed);
    }
    if (! t->adapter) {
        fprintf(stderr, "\n");
        fprintf(stderr, _("No target found.\n"));
        exit(-1);
    }

    /* Check CPU identifier. */
    t->cpuid = t->adapter->get_idcode(t->adapter);
    if (t->cpuid == 0) {
        /* Device not responding. */
        fprintf(stderr, _("Unknown CPUID=%08x.\n"), t->cpuid);
        t->adapter->close(t->adapter, 0);
        exit(1);
    }

    unsigned i;
    for (i=0; (t->cpuid ^ pic32_tab[i].devid) & 0x0fffffff; i++) {
        if (pic32_tab[i].devid == 0) {
            /* Device not detected. */
            fprintf(stderr, _("Unknown CPUID=%08x.\n"), t->cpuid);
            t->adapter->close(t->adapter, 0);
            exit(1);
        }
    }
    t->family = pic32_tab[i].family;
    t->cpu_name = pic32_tab[i].name;
    t->flash_addr = 0x1d000000;
    t->flash_bytes = pic32_tab[i].flash_kbytes * 1024;
    if (! t->flash_bytes) {
        t->flash_addr = t->adapter->user_start;
        t->flash_bytes = t->adapter->user_nbytes;
        t->boot_bytes = t->adapter->boot_nbytes;
    }
    t->adapter->family_name = t->family->name;
    t->adapter->family_name_short = t->family->name_short;

    return t;
}

/*
 * Close the device.
 */
void target_close(target_t *t, int power_on)
{
    t->adapter->close(t->adapter, power_on);
}

const char *target_cpu_name(target_t *t)
{
    return t->cpu_name;
}

unsigned target_idcode(target_t *t)
{
    return t->cpuid;
}

unsigned target_flash_bytes(target_t *t)
{
    return t->flash_bytes;
}

unsigned target_boot_bytes(target_t *t)
{
    return t->family->boot_kbytes * 1024;
}

unsigned target_devcfg_offset(target_t *t)
{
    return t->family->devcfg_offset;
}

unsigned target_block_size(target_t *t)
{
    return t->family->bytes_per_row;
}

/*
 * Add an entry to the pic32_tab[] array.
 */
void target_add_variant(char *name, unsigned id,
    char *family, unsigned flash_kbytes)
{
    int i;

    //printf("'%s'\t%07x\t'%s'\t%uk\n", name, id, family, flash_kbytes);
    for (i=0; i<TABSZ; i++) {
        if (pic32_tab[i].devid == 0 ||
            id == pic32_tab[i].devid) {
            /* Add a new entry or update an existing one
             * with new data from config file. */
            pic32_tab[i].name = strdup(name);
            pic32_tab[i].flash_kbytes = flash_kbytes;
            if (strcmp(family, "MX1") == 0)
                pic32_tab[i].family = &family_mx1;
            else if (strcmp(family, "MX3") == 0)
                pic32_tab[i].family = &family_mx3;
            else if (strcmp(family, "MZ") == 0)
                pic32_tab[i].family = &family_mz;
            else {
                fprintf(stderr, "%s: Unknown family=%s.\n", name, family);
            }
            break;
        }
    }
}

/*
 * Use PE for reading/writing/erasing memory.
 */
void target_use_executive(target_t *t)
{
    if (t->adapter->load_executive != 0 && t->family->pe_nwords != 0)
        t->adapter->load_executive(t->adapter,
            t->family->pe_code, t->family->pe_nwords, t->family->pe_version);
}

/*
 * Print configuration registers of the target CPU.
 */
void target_print_devcfg(target_t *t)
{
    if (! t->family->devcfg_offset)
        return;

    if (FAMILY_MM == t->family->name_short){
        uint32_t devcfg_addr = 0x1fc00000 + target_devcfg_offset(t);
        uint32_t offset_first = 0xc0;
        uint32_t offset_alternate = 0x40;
        
        uint32_t fdevopt = t->adapter->read_word(t->adapter, devcfg_addr + offset_first + 0x04);
        uint32_t ficd    = t->adapter->read_word(t->adapter, devcfg_addr + offset_first + 0x08);
        uint32_t fpor    = t->adapter->read_word(t->adapter, devcfg_addr + offset_first + 0x0c);
        uint32_t fwdt    = t->adapter->read_word(t->adapter, devcfg_addr + offset_first + 0x10);
        uint32_t foscsel = t->adapter->read_word(t->adapter, devcfg_addr + offset_first + 0x14);
        uint32_t fsec    = t->adapter->read_word(t->adapter, devcfg_addr + offset_first + 0x18);
        uint32_t afdevopt = t->adapter->read_word(t->adapter, devcfg_addr + offset_alternate + 0x04);
        uint32_t aficd    = t->adapter->read_word(t->adapter, devcfg_addr + offset_alternate + 0x08);
        uint32_t afpor    = t->adapter->read_word(t->adapter, devcfg_addr + offset_alternate + 0x0c);
        uint32_t afwdt    = t->adapter->read_word(t->adapter, devcfg_addr + offset_alternate + 0x10);
        uint32_t afoscsel = t->adapter->read_word(t->adapter, devcfg_addr + offset_alternate + 0x14);
        uint32_t afsec    = t->adapter->read_word(t->adapter, devcfg_addr + offset_alternate + 0x18);
        if (fdevopt == 0 || afdevopt == 0){
            fprintf(stderr, "Failed to read config value, or values are garbage\n");            
            return;
        } 
        print_mm(fdevopt, ficd, fpor, fwdt, foscsel, fsec,
                                afdevopt, aficd, afpor, afwdt, afoscsel, afsec);
    }
    else{
        /* MX, MK, MZ */
        unsigned devcfg_addr = 0x1fc00000 + target_devcfg_offset(t);
        unsigned devcfg3 = t->adapter->read_word(t->adapter, devcfg_addr);
        unsigned devcfg2 = t->adapter->read_word(t->adapter, devcfg_addr + 4);
        unsigned devcfg1 = t->adapter->read_word(t->adapter, devcfg_addr + 8);
        unsigned devcfg0 = t->adapter->read_word(t->adapter, devcfg_addr + 12);

        if (devcfg3 == 0xffffffff && devcfg2 == 0xffffffff &&
            devcfg1 == 0xffffffff && devcfg0 == 0x7fffffff)
            return;
        if (devcfg3 == 0 && devcfg2 == 0 && devcfg1 == 0 && devcfg0 == 0)
            return;

        printf(_("Configuration:\n"));
        t->family->print_devcfg(devcfg0, devcfg1, devcfg2, devcfg3,
                                0, 0, 0, 0, 0, 0, 0, 0);
    }
}

